Конфигурация/DataProcessors/ТБС_РасчетныеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>ТБС_РасчетныеЛисты</Name>
			<Comment>Расчетные листы</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ТБС_РасчетныеЛисты/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Объект.ФизЛицо      = Объект.Пользователь.ФизЛицо;
	
	ИсторияПросмотров.Параметры.УстановитьЗначениеПараметра("ФизЛицо",  Объект.ФизЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработкаПроверкиЗаполнения(Отказ);	
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	// Пользовательское соглашение
	ПросмотрСтраницы1 = Истина;
	ПолучитьРезультатПользовательскогоСоглашения();
	
	Если ПросмотрСтраницы2 Тогда
		ПолучитьПериодыРаботыСотрудника();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОбработкаПроверкиЗаполнения(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Отказ = Истина;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'У текущего пользователя не заполнено поле физлицо'"),Строка(Объект.Пользователь));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Объект.Пользователь,
		"Пользователь",, 
		Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьСтраниц()
	
	РасчетныйЛист.Очистить();
		
	Элементы.ГруппаПользовательскоеСоглашение.Видимость = ПросмотрСтраницы1;
	Элементы.ГруппаПериоды.Видимость			        = ПросмотрСтраницы2;
	Элементы.ГруппаРасчетныйЛист.Видимость	            = ПросмотрСтраницы3;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Пользовательское соглашение
#Область ПользовательскоеСоглашение
&НаСервере
Процедура ПолучитьРезультатПользовательскогоСоглашения()
	
	ID = ТБС_ОбщегоНазначения.ПолучитьПользовательскоеСоглашение(Объект.Пользователь,ТекущаяДата());
	
	Если ЗначениеЗаполнено(ID) Тогда
		
		ПросмотрСтраницы1 = Ложь;
		ПросмотрСтраницы2 = Истина;    
		
		ПолучитьПериодыРаботыСотрудника();
		
	Иначе
		
		Макет = Обработки.ТБС_РасчетныеЛисты.ПолучитьМакет("ПользовательскоеСоглашение");
		ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ПользовательскоеСоглашение.Вывести(ОблЗаголовок);
		
	КонецЕсли; 
	
	УстановитьВидимостьСтраниц();
	
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере()
	
	ТБС_ОбщегоНазначения.ЗаписатьДанныеВПользовательскоеСоглашение(Объект.Пользователь,Истина,Объект.ФизЛицо);
	
	ID = ТБС_ОбщегоНазначения.ПолучитьПользовательскоеСоглашение(Объект.Пользователь,ТекущаяДата());
	
	ПолучитьПериодыРаботыСотрудника();
	
	ПросмотрСтраницы1 = Ложь;
	ПросмотрСтраницы2 = Истина;
	
	УстановитьВидимостьСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	ПринятьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	ТБС_ОбщегоНазначения.ЗаписатьДанныеВПользовательскоеСоглашение(Объект.Пользователь,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Периоды

#Область Периоды

&НаСервере
Процедура ПолучитьПериодыРаботыСотрудника()
	
	ТЗ = ТБС_ОбщегоНазначения.ПолучитьПериодыРаботыПоСотруднику(ID);
	Периоды.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
			Объект.Период = НачалоМесяца(Элемент.ТекущиеДанные.Период);
			Элементы.ДекорацияПериод.Заголовок = "Период: " + Формат(Объект.Период,"ДФ='ММММ гггг ""г.""'");
			ПросмотрСтраницы2 = Ложь;
			ПросмотрСтраницы3 = Истина;
			
			УстановитьВидимостьСтраниц();
		
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Расчетный лист

#Область РасчетныйЛист
&НаСервере
Процедура СформироватьНаСервере()
	
	ТЗ = ТБС_ОбщегоНазначения.ПрочитатьДанныеИзРасчетныхЛистов(ID,Объект.Период);
	Если ТЗ.Количество() > 0 Тогда
		
		Печать(ТЗ);
		
	КонецЕсли; 	  
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СохранитьИсториюПросмотров();
	
	Элементы.ИсторияПросмотров.Обновить();
	
	ПолучитьПарольДляБезопасногоВхода();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	ПросмотрСтраницы2 = Истина;
	ПросмотрСтраницы3 = Ложь;
	
	УстановитьВидимостьСтраниц();
		
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПросмотровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область БезопасностьДанных

&НаКлиенте
Процедура ПолучитьПарольДляБезопасногоВхода()
	
	Данные = ПрочитатьДанныеИзБезопасногоХранилища();
	
	Параметр = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Наименование", Данные);
	Параметр.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Обработка.ТБС_РасчетныеЛисты.Форма.ФормаДанных",Параметр,ЭтотОбъект,,,,
                    Новый ОписаниеОповещения("ФормаВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт 
    
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
	Если Не ЗначениеЗаполнено(Данные) И ЗначениеЗаполнено(Результат) Тогда
		Данные = Результат;
	Иначе
		Данные = 0;
	КонецЕсли;
	
	ПрочитатьЗаписатьДанныеВБезопасноеХранилище();
	
	СформироватьНаСервере();

    
КонецПроцедуры // ФормаВыбораЗавершение

&НаСервере
Функция ПрочитатьДанныеИзБезопасногоХранилища()
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = ТБС_ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.ФизЛицо, Данные);  
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
	
КонецФункции

&НаСервере
Функция ПрочитатьЗаписатьДанныеВБезопасноеХранилище()
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ТБС_ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.ФизЛицо, Данные);  
	КонецЕсли; 
	
КонецФункции

Процедура СохранитьИсториюПросмотров()
	
	Структура = Новый Структура;
	Структура.Вставить("Пользователь",Объект.Пользователь);
	Структура.Вставить("ФизЛицо",     Объект.ФизЛицо);
	Структура.Вставить("Период",      ТекущаяДата());
	Структура.Вставить("Дата",        Объект.Период);
	
	ТБС_ОбщегоНазначения.ЗаписатьИсториюПросмотров(Структура);
	
КонецПроцедуры

Процедура Печать(ТЗ)
	
	Макет = Обработки.ТБС_РасчетныеЛисты.ПолучитьМакет("РасчетныйЛист");
	
	ОблШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОблСтрокаПустая = Макет.ПолучитьОбласть("СтрокаПустая");
	ОблСтрокаДанных = Макет.ПолучитьОбласть("СтрокаДанных");
	ОблСтрокаИтог   = Макет.ПолучитьОбласть("СтрокаИтог");
	
	РасчетныйЛист.Очистить();
	
	ОблШапка.Параметры.Сотрудник = "Иванов";
	ОблШапка.Параметры.Период    = Формат(Объект.Период,"ДФ='ММММ гггг ""г.""'");
	РасчетныйЛист.Вывести(ОблШапка);
	
	РасчетныйЛист.Вывести(ОблСтрокаПустая);
	
	//Начислено
	ОблСтрокаДанных.Параметры.Наименование = "Оплата труда";
	ОблСтрокаДанных.Параметры.Сумма        = 23444;
	
	РасчетныйЛист.Вывести(ОблСтрокаДанных);
	
	ОблСтрокаИтог.Параметры.Итого = "Всего начислено";
	ОблСтрокаИтог.Параметры.Сумма = 23444;
	
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	РасчетныйЛист.Вывести(ОблСтрокаПустая);
	//Удержано
	
	ОблСтрокаДанных.Параметры.Наименование = "НДФЛ";
	ОблСтрокаДанных.Параметры.Сумма        = 5000;
	
	РасчетныйЛист.Вывести(ОблСтрокаДанных);
	
	ОблСтрокаИтог.Параметры.Итого = "Удержано всего";
	ОблСтрокаИтог.Параметры.Сумма = 5000;
	
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	РасчетныйЛист.Вывести(ОблСтрокаПустая);
	
	//Вычеты
	ОблСтрокаИтог.Параметры.Итого = "Вычеты";
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	ОблСтрокаДанных.Параметры.Наименование = "Вычеты на детей";
	ОблСтрокаДанных.Параметры.Сумма        = 0;
	
	РасчетныйЛист.Вывести(ОблСтрокаДанных);
	РасчетныйЛист.Вывести(ОблСтрокаПустая);
	//Выплачено
	ОблСтрокаИтог.Параметры.Итого = "Выплачено";
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	ОблСтрокаИтог.Параметры.Итого = "Аванс";
	ОблСтрокаИтог.Параметры.Сумма = 10000;
	
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	РасчетныйЛист.Вывести(ОблСтрокаПустая);
	
	//Сумма к выплате
	ОблСтрокаИтог.Параметры.Итого = "Сумма к выплате";
	ОблСтрокаИтог.Параметры.Сумма = 15000; 
	РасчетныйЛист.Вывести(ОблСтрокаИтог);
	
	РасчетныйЛист.ВерхнийКолонтитул.ТекстСлева = "Дата печати: " + Строка(ТекущаяДата()) + " Пользователь: " + Строка(Объект.Пользователь); 
	РасчетныйЛист.ВерхнийКолонтитул.Выводить   = Истина;
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
